# Merging Dataframes
Merging is a concept that is often used in relational databases. It allows to combine multiple tables into one by joining the columns with respect to the values in a special key column. There are different options this can be achieved.

In [1]:
import pandas as pd
import numpy as np

<div style="display: flex; justify-content: center;">
    <img src="images/merging.png" alt="Image 1" style="width: 60%;">
    <img src="images/venn.png" alt="Image 2" style="width: 50%;">
</div>

In [2]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4],
                    'B': [0, np.pi, 2 * np.pi, 3 * np.pi],
                    'C': ['mouse', 'cat', 'dog', 'fish']})
df1

   A         B      C
0  1  0.000000  mouse
1  2  3.141593    cat
2  3  6.283185    dog
3  4  9.424778   fish

In [3]:
df2 = pd.DataFrame({'C': ['mouse', 'horse', 'lizard', 'fish'],
                    'D': [1.0, 1.7, 3.0, 2.1],
                    'E': [1, np.e, np.e ** 2, np.e ** 3]})
df2

        C    D          E
0   mouse  1.0   1.000000
1   horse  1.7   2.718282
2  lizard  3.0   7.389056
3    fish  2.1  20.085537

## Inner join
Inner join combines two dataframes based on a common key or column, and returns only the matching rows between the two dataframes.

In [4]:
df1.merge(df2, how='inner')

   A         B      C    D          E
0  1  0.000000  mouse  1.0   1.000000
1  4  9.424778   fish  2.1  20.085537

## Left Outer Join
The left outer join will keep all values from the left table (the one on which merge is called) and use NaN where the right table is missing the respective rows.

In [5]:
df1.merge(df2, how='left')

   A         B      C    D          E
0  1  0.000000  mouse  1.0   1.000000
1  2  3.141593    cat  NaN        NaN
2  3  6.283185    dog  NaN        NaN
3  4  9.424778   fish  2.1  20.085537

## Right Outer Join
The right outer join works just like the left outer join but the sides are swapped.

In [6]:
df1.merge(df2, how='right')

     A         B       C    D          E
0  1.0  0.000000   mouse  1.0   1.000000
1  NaN       NaN   horse  1.7   2.718282
2  NaN       NaN  lizard  3.0   7.389056
3  4.0  9.424778    fish  2.1  20.085537

## Outer Join
The columns and rows from both dataframes are combined. If there is no fitting value it is filled with a `NaN`.

In [7]:
df1.merge(df2, how='outer')

     A         B       C    D          E
0  1.0  0.000000   mouse  1.0   1.000000
1  2.0  3.141593     cat  NaN        NaN
2  3.0  6.283185     dog  NaN        NaN
3  4.0  9.424778    fish  2.1  20.085537
4  NaN       NaN   horse  1.7   2.718282
5  NaN       NaN  lizard  3.0   7.389056

<br>

## Overlapping column names

In [8]:
df2 = df2.rename(columns={'D': 'A'})
df2

        C    A          E
0   mouse  1.0   1.000000
1   horse  1.7   2.718282
2  lizard  3.0   7.389056
3    fish  2.1  20.085537

In [9]:
df1

   A         B      C
0  1  0.000000  mouse
1  2  3.141593    cat
2  3  6.283185    dog
3  4  9.424778   fish

If it is not implicitly clear on which column the join should occur, we have to tell Pandas which column to use.<br>
It can also perform the join on multiple columns but therefore the dtypes of the matched columns inside the two DataFrames must be equal.

In [10]:
df1.merge(df2, how='inner')

/opt/homebrew/Caskroom/miniforge/base/envs/py/lib/python3.10/site-packages/pandas/core/reshape/merge.py:1215: UserWarning: You are merging on int and float columns where the float values are not equal to their int representation.
  warnings.warn(

   A    B      C    E
0  1  0.0  mouse  1.0

In [11]:
df1.astype({"A": "float64"}).merge(df2, how='inner')

     A    B      C    E
0  1.0  0.0  mouse  1.0

#### merging `on`

In [12]:
df1.merge(df2, how='inner', on="C")

   A_x         B      C  A_y          E
0    1  0.000000  mouse  1.0   1.000000
1    4  9.424778   fish  2.1  20.085537

We can pass suffixes for better interpretability.

In [13]:
df1.merge(df2, how='inner', on='C', suffixes=('_from_df1', '_from_df2'))

   A_from_df1         B      C  A_from_df2          E
0           1  0.000000  mouse         1.0   1.000000
1           4  9.424778   fish         2.1  20.085537